Validation/chargeBumpRelaxation/verifySolution/0.org/Ue
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      gamma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    upWall        
    {
//        type            zeroGradient;
	type		fixedValue;
	value		uniform 0;
    }

    downWall       
    {
//        type            zeroGradient;
	type		fixedValue;
	value		uniform 0;
    }

    leftandright      
    {
//        type            zeroGradient;
	type 		fixedValue;
	value		uniform 0;
    }

    frontAndBack    
    {
        type            empty;
    }
}

// ************************************************************************* //
