Validation/chargeBumpRelaxation/verifySolution/0.org/rhoE.init
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rhoE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 1 0 0 1 0];

internalField   nonuniform List<scalar> 
65536
(
6.47324e-43
1.40528e-42
3.03218e-42
6.50272e-42
1.38607e-41
2.93646e-41
6.18318e-41
1.29405e-40
...
)
;

boundaryField
{
    upWall
    {
        type            zeroGradient;
    }
    downWall
    {
        type            zeroGradient;
    }
    leftandright
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
